---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettingsWarn
source: html/e9577497-10da-3552-0d46-e4ab0a26ec51.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettingsWarn Property

SunAndShadowSettings cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopySunAndShadowSettingsWarn { get; }
```